# from random import randint
# a = randint(100,999)
# b = input(a)
# k = a[0]
# c = a[1]
# d = a[2]
# print( c, d)

# a = input('Введите слово: ')
# b = a[1::2]
# print(b)

# a = input('Введите слово: ')
# if 'вверх' in a:
#     print(a.upper())
# elif 'вниз' in a:
#     print(a.lower())

# Напишие программу, которая будет считывать с клавиатуры пароль и проверять соответствует ли введенный пароль
# требованиям и возвращает True, если соответствует, и False, если нет.
# a = input('Введите слово: ')
# if a.isdigit() or a.isalpha():
#     print('ne')
# else:
#     print('ok')

# Введите строку, состоящую из трех слов, разделенных пробелами. 1) В первом слове найти все буквы 'а'. 2) Втором
# слове заменить маленькие буквы 'а' на большие 'А'. 3) Посчитать количество символов.
# a = input('Введите 3 слова: ')
# b = a.find(' ')
# c = a.rfind(' ')
# k = a[:b].count('a')
# print(k)
# k = a[b+1:c].replace('a','A')
# print(k)
# k = len(a[c+1:])
# print(k)
